In [17]:
import numpy as np

In [19]:
import pandas as pd

In [21]:
from numpy import NaN

In [27]:
data1 = {'Name':['person1','person2','person3','person4'],
     'Age':[23,45,NaN,88]}

data=pd.DataFrame(data1)
data

      Name   Age
0  person1  23.0
1  person2  45.0
2  person3   NaN
3  person4  88.0

In [35]:
data.isnull()

    Name    Age
0  False  False
1  False  False
2  False   True
3  False  False

In [33]:
data.isnull().sum()

Name    0
Age     1
dtype: int64

In [31]:
data.dropna()
# data.dropna(inplace = True)

      Name   Age
0  person1  23.0
1  person2  45.0
3  person4  88.0

In [37]:
data['Age'].dtype # if we have NaN then by default it shows float value

dtype('float64')

# Filling the missing values using mean,median,mode

In [40]:
data['Age'].fillna(data['Age'].mean()) #fill the empty place by mean

#data['Age'].fillna(data['Age'].mean(),inplace=True)

0    23.0
1    45.0
2    52.0
3    88.0
Name: Age, dtype: float64

In [42]:
data2 = {'Name':['person1','person2','person3','person4','person5'],
     'Age':[23,45,NaN,88,27]}

df=pd.DataFrame(data2)
df

      Name   Age
0  person1  23.0
1  person2  45.0
2  person3   NaN
3  person4  88.0
4  person5  27.0

In [44]:
df['Age'].dtype

dtype('float64')

In [48]:
df

      Name   Age
0  person1  23.0
1  person2  45.0
2  person3   NaN
3  person4  88.0
4  person5  27.0

In [50]:
df['Age'].fillna(df['Age'].mean()) # Fills the null value by the mean of the values

0    23.00
1    45.00
2    45.75
3    88.00
4    27.00
Name: Age, dtype: float64

In [54]:
df['Age'].mode()[0] # no of occurences placed on index 0

23.0

In [58]:
data['Age'].mode() # all the occurences of the numbers

0    23.0
1    45.0
2    88.0
Name: Age, dtype: float64

In [62]:
df['Age'].fillna(df['Age'].median())

0    23.0
1    45.0
2    36.0
3    88.0
4    27.0
Name: Age, dtype: float64